spec/fixtures/requests/add_foreign_device/unsigned_soap.xml

<soapenv:Envelope
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:v2="http://integration.sprint.com/common/header/WSMessageHeader/v2"
xmlns:sub="http://integration.sprint.com/interfaces/addForeignDevice/v1/addForeignDevice.xsd">
<soapenv:Header>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
</wsse:Security>
<v2:wsMessageHeader>
<v2:trackingMessageHeader>
<v2:applicationId>2222333344</v2:applicationId>
<v2:applicationUserId>BEQUICK</v2:applicationUserId>
<v2:consumerId>consumer_id</v2:consumerId>
<v2:messageId>9999999999</v2:messageId>
<v2:timeToLive>0</v2:timeToLive>
<v2:messageDateTimeStamp>2014-01-01T00:00:00.0Z</v2:messageDateTimeStamp>
</v2:trackingMessageHeader>
</v2:wsMessageHeader>
</soapenv:Header>
<soapenv:Body>
<sub:addForeignDevice>
<sub:deviceInfo>
<sub:deviceDetailInfo>
<sub:esnMeidDec>12345678AAA</sub:esnMeidDec>
</sub:deviceDetailInfo>
<sub:partNumber>PARTNUMBER</sub:partNumber>
<sub:brandCode>PLD</sub:brandCode>
<sub:skuType>BYO</sub:skuType>
</sub:deviceInfo>
</sub:addForeignDevice>
</soapenv:Body>
</soapenv:Envelope>
